[
  {
    "course_code": "Ae/AM/CE/ME 102 abc",
    "course_title": "Mechanics of Structures and Solids",
    "course_description": "Introduction to continuum mechanics: kinematics, balance laws, constitutive laws with an emphasis on solids. Static and dynamic stress analysis. Two- and three-dimensional theory of stressed elastic solids. Wave propagation. Analysis of rods, plates and shells with applications in a variety of fields. Variational theorems and approximate solutions. Elastic stability.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/AM/"
  },
  {
    "course_code": "CE/Ae/AM 108",
    "course_title": "Computational Mechanics",
    "course_description": "Numerical methods and techniques for solving initial boundary value problems in continuum mechanics (from heat conduction to statics and dynamics of solids and structures). Finite difference methods, direct methods, variational methods, finite elements in small strains and at finite deformation for applications in structural mechanics and solid mechanics. Solution of the partial differential equations of heat transfer, solid and structural mechanics, and fluid mechanics. Transient and nonlinear problems. Computational aspects and development and use of finite element code.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/AM/"
  },
  {
    "course_code": "AM/ACM 127",
    "course_title": "Calculus of Variations",
    "course_description": "First and second variations; Euler-Lagrange equation; Hamiltonian formalism; action principle; Hamilton-Jacobi theory; stability; local and global minima; direct methods and relaxation; isoperimetric inequality; asymptotic methods and gamma convergence; selected applications to mechanics, materials science, control theory and numerical methods.\n Not offered 2024-25.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/AM/"
  },
  {
    "course_code": "AM/CE/ME 150 abc",
    "course_title": "Graduate Engineering Seminar",
    "course_description": "Students attend a graduate seminar each week of each term and submit a report about the attended seminars. At least four of the attended seminars each term should be from the Mechanical and Civil Engineering seminar series. Students not registered for the M.S. and Ph.D. degrees must receive the instructor's permission. Graded pass/fail.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/AM/"
  },
  {
    "course_code": "AM/CE 151",
    "course_title": "Dynamics and Vibration",
    "course_description": "Equilibrium concepts, conservative and dissipative systems, Lagrange's equations, differential equations of motion for discrete single and multi degree-of-freedom systems, natural frequencies and mode shapes of these systems (Eigenvalue problem associated with the governing equations), phase plane analysis of vibrating systems, forms of damping and energy dissipated in damped systems, response to simple force pulses, harmonic and earthquake excitation, response spectrum concepts, vibration isolation, seismic instruments, dynamics of continuous systems, Hamilton's principle, axial vibration of rods and membranes, transverse vibration of strings, beams (Bernoulli-Euler and Timoshenko beam theory), and plates, traveling and standing wave solutions to motion of continuous systems, Rayleigh quotient and the Rayleigh-Ritz method to approximate natural frequencies and mode shapes of discrete and continuous systems, frequency domain solutions to dynamical systems, stability criteria for dynamical systems, and introduction to nonlinear systems and random vibration theory.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/AM/"
  },
  {
    "course_code": "AM/ME 165",
    "course_title": "Finite Elasticity",
    "course_description": "Finite theory of elasticity: constitutive theory, semi-inverse methods. Variational methods. Applications to problems of current interest.\n Not offered 2024-25.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/AM/"
  },
  {
    "course_code": "AM 200",
    "course_title": "Advanced Work in Applied Mechanics",
    "course_description": "A faculty mentor will oversee a student proposed, independent research or study project to meet the needs of graduate students. Graded pass/fail. The consent of a faculty mentor and a written report is required for each term of work.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/AM/"
  },
  {
    "course_code": "AM 201",
    "course_title": "Advanced Topics in Applied Mechanics",
    "course_description": "The faculty will prepare courses on advanced topics to meet the needs of graduate students.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/AM/"
  },
  {
    "course_code": "Ae/AM/MS/ME 213",
    "course_title": "Mechanics and Materials Aspects of Fracture",
    "course_description": "Analytical and experimental techniques in the study of fracture in metallic and nonmetallic solids. Mechanics of brittle and ductile fracture; connections between the continuum descriptions of fracture and micromechanisms. Discussion of elastic-plastic fracture analysis and fracture criteria. Special topics include fracture by cleavage, void growth, rate sensitivity, crack deflection and toughening mechanisms, as well as fracture of nontraditional materials. Fatigue crack growth and life prediction techniques will also be discussed. In addition, \"dynamic\" stress wave dominated, failure initiation growth and arrest phenomena will be covered. This will include traditional dynamic fracture considerations as well as discussions of failure by adiabatic shear localization.\n Not offered 2024-25",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/AM/"
  },
  {
    "course_code": "Ae/AM/CE/ME 214",
    "course_title": "Computational Solid Mechanics",
    "course_description": "This course focuses on the analysis of elastic thin shell structures in the large deformation regime. Problems of interest include softening behavior, bifurcations, loss of stability and localization. Introduction to the use of numerical methods in the solution of solid mechanics and multiscale mechanics problems. Variational principles. Finite element and isogeometric formulations for thin shells. Time integration, initial boundary value problems. Error estimation. Accuracy, stability and convergence. Iterative solution methods. Adaptive strategies.\n Not offered 2024-25.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/AM/"
  },
  {
    "course_code": "Ae/AM/ME 215",
    "course_title": "Dynamic Behavior of Materials",
    "course_description": "Fundamentals of theory of wave propagation; plane waves, wave guides, dispersion relations; dynamic plasticity, adiabatic shear banding; dynamic fracture; shock waves, equation of state.\n Not offered 2024-25",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/AM/"
  },
  {
    "course_code": "ME/MS/AM 221",
    "course_title": "Effective properties of heterogenous and meta-materials",
    "course_description": "Heterogenous materials. Notion of effective properties. Homogenization theory and applications to linear conductivity, elasticity and viscoelasticity. Effective properties in non-linear setting and instabilities.  Wave propagation and meta-materials. Bandgaps.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/AM/"
  },
  {
    "course_code": "Ae/AM/ME 223",
    "course_title": "Plasticity",
    "course_description": "Theory of dislocations in crystalline media. Characteristics of dislocations and their influence on the mechanical behavior in various crystal structures. Application of dislocation theory to single and polycrystal plasticity. Theory of the inelastic behavior of materials with negligible time effects. Experimental background for metals and fundamental postulates for plastic stress-strain relations. Variational principles for incremental elastic-plastic problems, uniqueness. Upper and lower bound theorems of limit analysis and shakedown. Slip line theory and applications. Additional topics may include soils, creep and rate-sensitive effects in metals, the thermodynamics of plastic deformation, and experimental methods in plasticity.\n Not offered 2024-25",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/AM/"
  },
  {
    "course_code": "ME/MS/Ae/AM 224",
    "course_title": "Multifunctional Materials",
    "course_description": "Multiscale view of materials and different approaches of introducing functionality; Electronic aspects and multiferroic materials; Symmetry breaking phase transformations, microstructure: shape-memory alloys, ferroelectrics, liquid crystal elastomers; Composite materials and metamaterials: multifunctional structures.\n Not offered 2024-25.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/AM/"
  },
  {
    "course_code": "Ae/AM/ME/Ge 225",
    "course_title": "Special Topics in Solid Mechanics",
    "course_description": "Subject matter changes depending on staff and student interest.\n Not offered 2024-25",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/AM/"
  },
  {
    "course_code": "AM/CE/ME 252",
    "course_title": "Linear and Nonlinear Waves in Structured Media",
    "course_description": "The course will cover the basic principles of wave propagation in solid media. It will discuss the fundamental principles used to describe linear and nonlinear wave propagation in continuum and discrete media. Selected recent scientific advancements in the dynamics of periodic media will also be discussed. Students learn the basic principles governing the propagation of waves in discrete and continuum solid media. These methods can be used to engineer materials with predefined properties and to design dynamical systems for a variety of engineering applications (e.g., vibration mitigation, impact absorption and sound insulation). The course will include an experimental component, to test wave phenomena in structured media.\n Not offered 2024-25.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/AM/"
  },
  {
    "course_code": "Ae/AM/CE/ME/Ge 265 ab",
    "course_title": "Static and Dynamic Failure of Brittle Solids and Interfaces, from the Micro to the Mega",
    "course_description": "Linear elastic fracture mechanics of homogeneous brittle solids (e.g. geo-materials, ceramics, metallic glasses); small scale yielding concepts; experimental methods in fracture, fracture of bi-material interfaces with applications to composites as well as bonded and layered engineering and geological structures; thin-film and micro-electronic components and systems; dynamic fracture mechanics of homogeneous engineering materials; dynamic shear dominated failure of coherent and incoherent interfaces at all length scales; dynamic rupture of frictional interfaces with application to earthquake source mechanics; allowable rupture speeds regimes and connections to earthquake seismology and the generation of Tsunamis.\n Not offered 2024-25",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/AM/"
  },
  {
    "course_code": "AM 300",
    "course_title": "Research in Applied Mechanics",
    "course_description": "Research in the field of applied mechanics. By arrangement with members of the staff, properly qualified graduate students are directed in research.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/AM/"
  },
  {
    "course_code": "Ae 100",
    "course_title": "Research in Aerospace",
    "course_description": "Open to suitably qualified undergraduates and first-year graduate students under the direction of the staff. Credit is based on the satisfactory completion of a substantive research report, which must be approved by the Ae 100 adviser and by the option representative.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/Ae/"
  },
  {
    "course_code": "Ae/APh/CE/ME 101 abc",
    "course_title": "Fluid Mechanics",
    "course_description": "Fundamentals of fluid mechanics. Microscopic and macroscopic properties of liquids and gases; the continuum hypothesis; review of thermodynamics; general equations of motion; kinematics; stresses; constitutive relations; vorticity, circulation; Bernoulli's equation; potential flow; thin-airfoil theory; surface gravity waves; buoyancy-driven flows; rotating flows; viscous creeping flow; viscous boundary layers; introduction to stability and turbulence; quasi one-dimensional compressible flow; shock waves; unsteady compressible flow; and acoustics.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/Ae/"
  },
  {
    "course_code": "Ae/AM/CE/ME 102 abc",
    "course_title": "Mechanics of Structures and Solids",
    "course_description": "Introduction to continuum mechanics: kinematics, balance laws, constitutive laws with an emphasis on solids. Static and dynamic stress analysis. Two- and three-dimensional theory of stressed elastic solids. Wave propagation. Analysis of rods, plates and shells with applications in a variety of fields. Variational theorems and approximate solutions. Elastic stability.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/Ae/"
  },
  {
    "course_code": "Ae 103 ab",
    "course_title": "Aerospace Control Systems",
    "course_description": "Part a: Linear state space systems, including concepts of controllability/reachability and observability. State feedback and optimal control. Frequency domain tools (Bode plots, Nyquist analysis, input/output performance). Part b: Optimization-based design of control systems, including optimal control and receding horizon control. Introductory random processes and optimal estimation. Kalman filtering and nonlinear filtering methods for autonomous systems.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/Ae/"
  },
  {
    "course_code": "Ae/APh 104 abc",
    "course_title": "Experimental Methods",
    "course_description": "Lectures on experiment design and implementation. Measurement methods, transducer fundamentals, instrumentation, optical systems, signal processing, noise theory, analog and digital electronic fundamentals, with data acquisition and processing systems. Experiments (second and third terms) in solid and fluid mechanics with emphasis on current research methods.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/Ae/"
  },
  {
    "course_code": "Ae 105 abc",
    "course_title": "Space Engineering",
    "course_description": "Part a: Design of space missions based on astrodynamics. Topics include conic orbits with perturbations (J2, drag, and solar radiation pressure), Lambert's Theorem, periodic orbits and ground tracks, invariant manifolds, and the variational equation with mission applications to planetary flybys, constellation, formation flying, and low energy planetary capture and landing. Part b: Introduction to spacecraft systems and subsystems, mission design, rocket mechanics, launch vehicles, and space environments; spacecraft mechanical, structural, and thermal design; communication and power systems; preliminary discussion and setup for team project leading to system requirements review. Part c: Team project leading to preliminary design review and critical design review.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/Ae/"
  },
  {
    "course_code": "CE/Ae/AM 108",
    "course_title": "Computational Mechanics",
    "course_description": "Numerical methods and techniques for solving initial boundary value problems in continuum mechanics (from heat conduction to statics and dynamics of solids and structures). Finite difference methods, direct methods, variational methods, finite elements in small strains and at finite deformation for applications in structural mechanics and solid mechanics. Solution of the partial differential equations of heat transfer, solid and structural mechanics, and fluid mechanics. Transient and nonlinear problems. Computational aspects and development and use of finite element code.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/Ae/"
  },
  {
    "course_code": "Ae 115 ab",
    "course_title": "Spacecraft Navigation",
    "course_description": "This course will survey all aspects of modern spacecraft navigation, including astrodynamics, tracking systems for both low-Earth and deep-space applications (including the Global Positioning System and the Deep Space Network observables), and the statistical orbit determination problem (in both the batch and sequential Kalman filter implementations). The course will describe some of the scientific applications directly derived from precision orbital knowledge, such as planetary gravity field and topography modeling. Numerous examples drawn from actual missions as navigated at JPL will be discussed.\n Not offered 2024-25.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/Ae/"
  },
  {
    "course_code": "Ae/ME 118",
    "course_title": "Classical Thermodynamics",
    "course_description": "Fundamentals of Classical Thermodynamics. Basic laws of thermodynamics, work and heat, entropy and available work, and thermal systems. Equations of state, compressibility functions, and the Law of Corresponding States. Thermodynamic potentials, phase equilibrium, phase transitions, and thermodynamic properties of solids, liquids, and gases. Examples will be drawn from fluid dynamics, solid mechanics, energy systems, and thermal-science applications.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/Ae/"
  },
  {
    "course_code": "ME/Ae 120",
    "course_title": "Combustion Fundamentals",
    "course_description": "The course will cover chemical equilibrium, chemical kinetics, combustion chemistry, transport phenomena, and the governing equations for multicomponent gas mixtures. Topics will be chosen from non-premixed and premixed flames, laminar and turbulent flames, combustion-generated pollutants, and numerical simulations of reacting flows.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/Ae/"
  },
  {
    "course_code": "Ae 121 abc",
    "course_title": "Space Propulsion",
    "course_description": "Ae 121 is designed to introduce the fundamentals of chemical, electric and advanced propulsion technologies.  The course focuses on the thermochemistry and aerodynamics of chemical and electrothermal propulsion systems, the physics of ionized gases and electrostatic and electromagnetic processes in electric thrusters.  These analyses provide the opportunity to introduce the basic concepts of non-equilibrium gas dynamics and kinetic theory. Specific technologies such as launch vehicle rocket engines, monopropellant engines, arcjets, ion thrusters, magnetoplasmadynamic engines and Hall thrusters will be discussed.  Ae 121 also provides an introduction to advanced propulsion concepts such as solar sails and antimatter rockets.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/Ae/"
  },
  {
    "course_code": "Ae 150 abc",
    "course_title": "Aerospace Engineering Seminar",
    "course_description": "Speakers from campus and outside research and manufacturing organizations discuss current problems and advances in aerospace engineering. Graded pass/fail.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/Ae/"
  },
  {
    "course_code": "APh/Ph/Ae/MS 153",
    "course_title": "Fundamentals of Energy and Mass Transport in Small Scale Systems",
    "course_description": "The design of instrumentation for cooling, sensing or measurement in microsystems requires special knowledge of the evolution and propagation of thermal and concentration gradients in confined geometries, which ultimately control the degree of maximum energy and mass exchange. A significant challenge facing the microelectronics industry, for example, is mitigation of hot spots in densely packed high power chips for artificial intelligence to prevent thermal runaway. This course offers a concise treatment of the fundamentals of mass and energy transport by examining steady and unsteady diffusive and convective processes in small confined systems. Contrasts with macroscale behavior caused by the effects of small scale confinement and reduced dimensionality will be examined. Sample problems will be drawn from systems in applied physics, material science, electrical and bioengineering. Students must have working knowledge of vector calculus, ODEs, basic PDEs, and complex variables.\n Not offered 2024-25.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/Ae/"
  },
  {
    "course_code": "EE/Ae 157 ab",
    "course_title": "Introduction to the Physics of Remote Sensing",
    "course_description": "An overview of the physics behind space remote sensing instruments. Topics include the interaction of electromagnetic waves with natural surfaces, including scattering of microwaves, microwave and thermal emission from atmospheres and surfaces, and spectral reflection from natural surfaces and atmospheres in the near-infrared and visible regions of the spectrum. The class also discusses the design of modern space sensors and associated technology, including sensor design, new observation techniques, ongoing developments, and data interpretation. Examples of applications and instrumentation in geology, planetology, oceanography, astronomy, and atmospheric research.\n Part a offered spring term; Part b not offered 2024-25",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/Ae/"
  },
  {
    "course_code": "Ae 159",
    "course_title": "Optical Engineering",
    "course_description": "This class covers both the fundamentals of optical engineering and the development of space optical systems. Emphasis is on the design and engineering of optical, UV and IR systems for scientific remote sensing and imaging applications. Material covered is: first order optics to find the location, size and orientation of an image; geometrical aberration theory balancing tolerancing optical systems; transmittance, Etendu vignetting; radiative transfer; scalar vector wave propagation-physical optics; scalar diffraction image formation coherence; interferometry for the measurement of optical surfaces astronomy; optical metrology wavefront sensing control (A/O); segmented and sparse aperture telescopes; and design topics in coronagraphy, Fourier transform spectrometers, grating spectrometers, and large aperture telescopes. Space optics issues discussed will be segmented sparse aperture telescopes, radiation damage to glass, thermal and UV contamination.\n Not offered 2024-25.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/Ae/"
  },
  {
    "course_code": "Ae/Ge/ME 160 ab",
    "course_title": "Continuum Mechanics of Fluids and Solids",
    "course_description": "Elements of Cartesian tensors. Configurations and motions of a body. Kinematics-study of deformations, rotations and stretches, polar decomposition. Lagrangian and Eulerian strain velocity and spin tensor fields. Irrotational motions, rigid motions. Kinetics-balance laws. Linear and angular momentum, force, traction stress. Cauchy's theorem, properties of Cauchy's stress. Equations of motion, equilibrium equations. Power theorem, nominal (Piola-Kirchoff) stress. Thermodynamics of bodies. Internal energy, heat flux, heat supply. Laws of thermodynamics, notions of entropy, absolute temperature. Entropy inequality (Clausius-Duhem). Examples of special classes of constitutive laws for materials without memory. Objective rates, corotational, convected rates. Principles of materials frame indifference. Examples: the isotropic Navier-Stokes fluid, the isotropic thermoelastic solid. Basics of finite differences, finite elements, and boundary integral methods, and their applications to continuum mechanics problems illustrating a variety of classes of constitutive laws.\n part b not offered 2024-25",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/Ae/"
  },
  {
    "course_code": "Ae/CE 165 ab",
    "course_title": "Mechanics of Composite Materials and Structures",
    "course_description": "Introduction and fabrication technology, elastic deformation of composites, stiffness bounds, on- and off-axis elastic constants for a lamina, elastic deformation of multidirectional laminates (lamination theory, ABD matrix), effective hygrothermal properties, mechanisms of yield and failure for a laminate, strength of a single ply, failure models, splitting and delamination. Experimental methods for characterization and testing of composite materials. Design criteria, application of design methods to select a suitable laminate using composite design software, hand layup of a simple laminate and measurement of its stiffness and thermoelastic coefficients.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/Ae/"
  },
  {
    "course_code": "Ae 200",
    "course_title": "Advanced Research in Aerospace",
    "course_description": "Ae.E. or Ph.D. thesis level research under the direction of the staff. A written research report must be submitted during finals week each term.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/Ae/"
  },
  {
    "course_code": "Ae 201 ab",
    "course_title": "Advanced Fluid Mechanics",
    "course_description": "Extensions on the foundations of the mechanics of fluids. Basic concepts will be emphasized; transition from incompressible and potential flow to weakly compressible flow; acoustics and sound generation; transonic flow; fully compressible flow; flow past bodies and shock waves; small-Mach number expansion; Navier-Stokes shock structure; elements of the kinetic theory of gases; Lagrangian form of equations of motion; velocity-gradient tensor and vorticity; vortex dynamics; exact solutions; incompressible potential flow; free-streamline flows; scalar mixing.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/Ae/"
  },
  {
    "course_code": "Ae 204 ab",
    "course_title": "Technical Fluid Mechanics",
    "course_description": "External and internal flow problems encountered in engineering, for which only empirical methods exist. Turbulent shear flow, separation, transition, three-dimensional and nonsteady effects. Basis of engineering practice in the design of devices such as mixers, ejectors, diffusers, and control valves. Studies of flow-induced oscillations, wind effects on structures, vehicle aerodynamics.\n Not offered 2024-25.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/Ae/"
  },
  {
    "course_code": "Ae 205 ab",
    "course_title": "Advanced Space Project",
    "course_description": "This is an advanced course on the design and implementation of space projects and it is currently focused on the flight project Autonomous Assembly of a Reconfigurable Space Telescope (AAReST). The objective is to be ready for launch and operation in 2015. Each student will be responsible for a specific activity, chosen from the following: optimization of telescope system architecture; design, assembly and testing of telescope optics; telescope calibration procedure and algorithms for wavefront control; thermal analysis; boom design and deployment test methods; effects of spacecraft dynamics on telescope performance; environmental testing of telescope system. Each student will prepare a survey of the state of the art for the selected activity, and then develop a design/implementation plan, execute the plan and present the results in a final report.\n Not offered 2024-25.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/Ae/"
  },
  {
    "course_code": "Ae 208 abc",
    "course_title": "GALCIT Colloquium",
    "course_description": "A seminar course in fluid, solid, space, and bio mechanics. Weekly lectures on current developments are presented by staff members, graduate students, and visiting scientists and engineers. Graded pass/fail.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/Ae/"
  },
  {
    "course_code": "Ae/AM/MS/ME 213",
    "course_title": "Mechanics and Materials Aspects of Fracture",
    "course_description": "Analytical and experimental techniques in the study of fracture in metallic and nonmetallic solids. Mechanics of brittle and ductile fracture; connections between the continuum descriptions of fracture and micromechanisms. Discussion of elastic-plastic fracture analysis and fracture criteria. Special topics include fracture by cleavage, void growth, rate sensitivity, crack deflection and toughening mechanisms, as well as fracture of nontraditional materials. Fatigue crack growth and life prediction techniques will also be discussed. In addition, \"dynamic\" stress wave dominated, failure initiation growth and arrest phenomena will be covered. This will include traditional dynamic fracture considerations as well as discussions of failure by adiabatic shear localization.\n Not offered 2024-25",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/Ae/"
  },
  {
    "course_code": "Ae/AM/CE/ME 214",
    "course_title": "Computational Solid Mechanics",
    "course_description": "This course focuses on the analysis of elastic thin shell structures in the large deformation regime. Problems of interest include softening behavior, bifurcations, loss of stability and localization. Introduction to the use of numerical methods in the solution of solid mechanics and multiscale mechanics problems. Variational principles. Finite element and isogeometric formulations for thin shells. Time integration, initial boundary value problems. Error estimation. Accuracy, stability and convergence. Iterative solution methods. Adaptive strategies.\n Not offered 2024-25.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/Ae/"
  },
  {
    "course_code": "Ae/AM/ME 215",
    "course_title": "Dynamic Behavior of Materials",
    "course_description": "Fundamentals of theory of wave propagation; plane waves, wave guides, dispersion relations; dynamic plasticity, adiabatic shear banding; dynamic fracture; shock waves, equation of state.\n Not offered 2024-25",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/Ae/"
  },
  {
    "course_code": "Ae/ME/APh 218",
    "course_title": "Statistical Mechanics",
    "course_description": "Overview of probability and statistics, and the Maxwell-Boltzmann distribution. Overview and elements of Quantum Mechanics, degenerate energy states, particles in a box, and energy-state phase space. Statistics of indistinguishable elementary particles, Fermi-Dirac and Bose-Einstein statistics, partition functions, connections with classical thermodynamics, and the Law of Equipartition. Examples from equilibrium in fluids, solid-state physics, and others.\n Not offered 2024-25",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/Ae/"
  },
  {
    "course_code": "Ae 220",
    "course_title": "Theory of Structures",
    "course_description": "Fundamentals of buckling and stability, total potential energy and equilibrium approaches; snap-through and bifurcation instabilities; eigenvalues and eigenvectors of stiffness matrix; Rayleigh-Ritz estimates of buckling loads; buckling of rods; imperfection sensitivity; elastic-plastic buckling; buckling of plates and shells. Selected topics: localization and wrinkling of membranes and solids; stability landscapes for shells and other topics.\n Not offered 2024-25.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/Ae/"
  },
  {
    "course_code": "Ae/CE 221",
    "course_title": "Space Structures",
    "course_description": "This course examines the links between form, geometric shape, and structural performance. It deals with different ways of breaking up a continuum, and how this affects global structural properties; structural concepts and preliminary design methods that are used in tension structures and deployable structures. Geometric foundations, polyhedra and tessellations, surfaces; space frames, examples of space frames, stiffness and structural efficiency of frames with different repeating units; sandwich plates; cable and membrane structures, form-finding, wrinkle-free pneumatic domes, balloons, tension-stabilized struts, tensegrity domes; deployable and adaptive structures, coiled rods and their applications, flexible shells, membranes, structural mechanisms, actuators, concepts for adaptive trusses and manipulators.\n Not offered 2024-25",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/Ae/"
  },
  {
    "course_code": "Ae/AM/ME 223",
    "course_title": "Plasticity",
    "course_description": "Theory of dislocations in crystalline media. Characteristics of dislocations and their influence on the mechanical behavior in various crystal structures. Application of dislocation theory to single and polycrystal plasticity. Theory of the inelastic behavior of materials with negligible time effects. Experimental background for metals and fundamental postulates for plastic stress-strain relations. Variational principles for incremental elastic-plastic problems, uniqueness. Upper and lower bound theorems of limit analysis and shakedown. Slip line theory and applications. Additional topics may include soils, creep and rate-sensitive effects in metals, the thermodynamics of plastic deformation, and experimental methods in plasticity.\n Not offered 2024-25",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/Ae/"
  },
  {
    "course_code": "ME/MS/Ae/AM 224",
    "course_title": "Multifunctional Materials",
    "course_description": "Multiscale view of materials and different approaches of introducing functionality; Electronic aspects and multiferroic materials; Symmetry breaking phase transformations, microstructure: shape-memory alloys, ferroelectrics, liquid crystal elastomers; Composite materials and metamaterials: multifunctional structures.\n Not offered 2024-25.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/Ae/"
  },
  {
    "course_code": "Ae/AM/ME/Ge 225",
    "course_title": "Special Topics in Solid Mechanics",
    "course_description": "Subject matter changes depending on staff and student interest.\n Not offered 2024-25",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/Ae/"
  },
  {
    "course_code": "Ae/ACM/ME 232 ab",
    "course_title": "Computational Fluid Dynamics",
    "course_description": "Development and analysis of algorithms used in the solution of fluid mechanics problems. Numerical analysis of discretization schemes for partial differential equations including interpolation, integration, spatial discretization, systems of ordinary differential equations; stability, accuracy, aliasing, Gibbs and Runge phenomena, numerical dissipation and dispersion; boundary conditions. Survey of finite difference, finite element, finite volume and spectral approximations for the numerical solution of the incompressible and compressible Euler and Navier-Stokes equations, including shock-capturing methods.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/Ae/"
  },
  {
    "course_code": "Ae 233",
    "course_title": "Hydrodynamic Stability",
    "course_description": "Laminar-stability theory as a guide to laminar-turbulent transition. Rayleigh equation, instability criteria, and response to small inviscid disturbances. Discussion of Kelvin-Helmholtz, Rayleigh-Taylor, Richtmyer-Meshkov, and other instabilities, for example, in geophysical flows. The Orr-Sommerfeld equation, the dual role of viscosity, and boundary-layer stability. Non-normality of the linearized Navier-Stokes operator, and transient growth. Weakly nonlinear stability theory and phenomenological theories of turbulence.\nNot offered 2024-25",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/Ae/"
  },
  {
    "course_code": "Ae 234 ab",
    "course_title": "Hypersonic Aerodynamics",
    "course_description": "An advanced course dealing with aerodynamic problems of flight at hyper-sonic speeds. Topics are selected from hypersonic small-disturbance theory, blunt-body theory, boundary layers and shock waves in real gases, heat and mass transfer, testing facilities and experiment.\n Not offered 2024-25",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/Ae/"
  },
  {
    "course_code": "Ae 235",
    "course_title": "Rarefied Gasdynamics",
    "course_description": "Molecular description of matter; distribution functions; discrete-velocity gases. Kinetic theory: free-path theory, internal degrees of freedom. Boltzmann equation: BBGKY hierarchy and closure, H theorem, Euler equations, Chapman-Enskog procedure, free-molecule flows. Collisionless and transitional flows. Direct simulation Monte Carlo methods. Applications.\n Not offered 2024-25.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/Ae/"
  },
  {
    "course_code": "Ae 237 ab",
    "course_title": "Nonsteady Gasdynamics",
    "course_description": "Part a: dynamics of shock waves, expansion waves, and related discontinuities in gases. Adiabatic phase-transformation waves. Interaction of waves in one- and two-dimensional flows. Boundary layers and shock structure. Applications and shock tube techniques. Part b: shock and detonation waves in solids and liquids. Equations of state for hydrodynamic computations in solids, liquids, and explosive reaction products. CJ and ZND models of detonation in solids and liquids. Propagation of shock waves and initiation of reaction in explosives. Interactions of detonation waves with water and metals.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/Ae/"
  },
  {
    "course_code": "Ae 239 ab",
    "course_title": "Turbulence",
    "course_description": "Reynolds number, transition from steady to unsteady, chaotic, and turbulent flow. Reynolds-averaged equations. Statistical description of turbulence. Physical and spectral models. Homogeneous isotropic turbulence, intermediate and small scales. Large-scale structure, and turbulent free and wall-bounded shear flows. Turbulent mixing.\n Part b not offered in 2024-25.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/Ae/"
  },
  {
    "course_code": "Ae 240",
    "course_title": "Special Topics in Fluid Mechanics",
    "course_description": "Topics and subject matter descriptions change each year depending upon staff and student interest.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/Ae/"
  },
  {
    "course_code": "Ae 241",
    "course_title": "Special Topics in Experimental Fluid and Solid Mechanics",
    "course_description": "Subject matter changes depending upon staff and student interest.\n Not offered 2024-25.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/Ae/"
  },
  {
    "course_code": "Ae/BE 242",
    "course_title": "Biological Flows: Propulsion",
    "course_description": "Physical principles of unsteady fluid momentum transport: equations of motion, dimensional analysis, conservation laws. Unsteady vortex dynamics: vorticity generation and dynamics, vortex dipoles/rings, wake structure in unsteady flows. Life in moving fluids: unsteady drag, added-mass effects, virtual buoyancy, bounding and schooling, wake capture. Thrust generation by flapping, undulating, rowing, jetting. Low Reynolds number propulsion. Bioinspired design of propulsion devices.\n Not offered 2024-25",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/Ae/"
  },
  {
    "course_code": "MedE/BE/Ae 243",
    "course_title": "Physiological Mechanics",
    "course_description": "Internal flows: steady and pulsatile blood flow in compliant vessels, internal flows in organisms. Fluid dynamics of the human circulatory system: heart, veins, and arteries (microcirculation). Mass and momentum transport across membranes and endothelial layers. Fluid mechanics of the respiratory system. Renal circulation and circulatory system. Biological pumps. Low and High Reynolds number locomotion.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/Ae/"
  },
  {
    "course_code": "Ae 250",
    "course_title": "Reading and Independent Study",
    "course_description": "Graded pass/fail only.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/Ae/"
  },
  {
    "course_code": "Ae/CDS/ME 251 ab",
    "course_title": "Closed Loop Flow Control",
    "course_description": "This course seeks to introduce students to recent developments in theoretical and practical aspects of applying control to flow phenomena and fluid systems. Lecture topics in the second term drawn from: the objectives of flow control; a review of relevant concepts from classical and modern control theory; high-fidelity and reduced-order modeling; principles and design of actuators and sensors. Third term: laboratory work in open- and closed-loop control of boundary layers, turbulence, aerodynamic forces, bluff body drag, combustion oscillations and flow-acoustic oscillations.\n Not offered 2024-25",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/Ae/"
  },
  {
    "course_code": "Ae/AM/CE/ME/Ge 265 ab",
    "course_title": "Static and Dynamic Failure of Brittle Solids and Interfaces, from the Micro to the Mega",
    "course_description": "Linear elastic fracture mechanics of homogeneous brittle solids (e.g. geo-materials, ceramics, metallic glasses); small scale yielding concepts; experimental methods in fracture, fracture of bi-material interfaces with applications to composites as well as bonded and layered engineering and geological structures; thin-film and micro-electronic components and systems; dynamic fracture mechanics of homogeneous engineering materials; dynamic shear dominated failure of coherent and incoherent interfaces at all length scales; dynamic rupture of frictional interfaces with application to earthquake source mechanics; allowable rupture speeds regimes and connections to earthquake seismology and the generation of Tsunamis.\n Not offered 2024-25",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/Ae/"
  },
  {
    "course_code": "ME/Ge/Ae 266 ab",
    "course_title": "Fracture and Frictional Faulting",
    "course_description": "Introduction to elastodynamics and waves in solids. Fracture theory, energy concepts, cohesive zone models. Friction laws, nucleation of frictional instabilities, rupture of frictional interfaces. Radiation from moving cracks. Thermal effects during dynamic fracture and faulting. Interaction of faulting with fluids. Applications to engineering phenomena a physics and mechanics of earthquakes.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/Ae/"
  },
  {
    "course_code": "An 97",
    "course_title": "Undergraduate Research",
    "course_description": "This course offers advanced undergraduates the opportunity to pursue research in Anthropology individually or in a small group. Graded pass/fail.\n Not offered 2024-25.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/An/"
  },
  {
    "course_code": "An 101",
    "course_title": "Selected Topics in Anthropology",
    "course_description": "Topics to be determined by instructor.\n Not offered 2024-25.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/An/"
  },
  {
    "course_code": "An/PS 127",
    "course_title": "Corruption",
    "course_description": "Corruption taxes economies and individuals in both the developing and the developed world. We will examine what corruption means in different places and contexts, from grand financial scandals to misappropriation of all manner of public resources. How do we measure corruption? What are its costs and social consequences? What have culture and psychology got to do with it? How much do governance and a free press matter? What are the potential solutions? Students will work closely with the professor to develop an independent and original research project of their choice. Limited enrollment.\n Not offered 2024-25.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/An/"
  },
  {
    "course_code": "SA 15 abc",
    "course_title": "Student Publications",
    "course_description": "This course will enable students to produce quality, journalistically-crafted stories for the Tech newspaper. It will teach journalistic values of clarity, accuracy, fairness and balance, and acquaint the students with the primary elements of journalism, including reporting, basic story structure and news/opinion-writing distinctions. Students will produce feature stories for the Tech (with assigned art or graphics) about campus life and activities, profiles of campus faculty or staff, and issues of campus community interest. May be re-taken for credit.\n Not offered 2022-23.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/SA/"
  },
  {
    "course_code": "SA 16 abc",
    "course_title": "Cooking Basics",
    "course_description": "The class will survey different cooking styles, techniques, and cuisines from around the world. Topics covered may include knives and tools; tastes and flavors; sauces and reductions; legumes, grains, and beans; meat; dessert. The emphasis will be on presentation and creativity.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/SA/"
  },
  {
    "course_code": "SA 42",
    "course_title": "Computer Science Education in K-14 Settings Practicum",
    "course_description": "This course is a follow-on for students who have already taken CS 42 and would like to continue as part of a teaching group partnered with a local school or community college. Each week students are expected to spend about 2 hours teaching and 2 hours developing curricula. Students may take SA 42 multiple times. Graded pass/fail only.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/SA/"
  },
  {
    "course_code": "SA 80 abc",
    "course_title": "Health Advocates",
    "course_description": "A course designed to involve students with health care and education, develop familiarity with common college health problems, and provide peer health services on and off campus. The training involves American Red Cross Emergency Medical Response certification, routine illnesses and injuries and peer counseling. All training is cumulative from the prior term. Opportunities to volunteer at community first aid stations are provided.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/SA/"
  },
  {
    "course_code": "SA 81",
    "course_title": "Peer Advocates",
    "course_description": "A course designed to involve students with appropriate peer support and education, develop familiarity with common college mental health problems, and provide peer mental health support to students on and off campus. Active listening skills, identifying students in distress, suicide prevention, lectures and discussions on substance abuse, dating violence, sexual assault, depression, and other relevant mental health topics, as well as ongoing consultation about practical experience. Enrolled with permission only.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/SA/"
  },
  {
    "course_code": "BEM 97",
    "course_title": "Undergraduate Research",
    "course_description": "This course offers advanced undergraduates the opportunity to pursue research on a business problem individually or in a small group. Graded pass/fail.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/BEM/"
  },
  {
    "course_code": "BEM 101",
    "course_title": "Selected Topics in Business Economics and Management",
    "course_description": "Topics determined by instructor.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/BEM/"
  },
  {
    "course_code": "BEM 102",
    "course_title": "Introduction to Accounting",
    "course_description": "This course combines accounting and finance in a dynamic, user-oriented approach. The goal is to enable students to understand what financial statements are (sources of information about a company), what they are not (facts devoid of interpretation or management influence), and how to critically understand and analyze them. The course will utilize actual SEC filings for several companies, across a variety of industries, through which the students will be exposed to important accounting concepts.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/BEM/"
  },
  {
    "course_code": "BEM 103",
    "course_title": "Introduction to Finance",
    "course_description": "Finance, or financial economics, covers two main areas: asset pricing and corporate finance. For asset pricing, a field that studies how investors value securities and make investment decisions, we will discuss topics like prices, risk, and return, portfolio choice, CAPM, market efficiency and bubbles, interest rates and bonds, and futures and options. For corporate finance, a field that studies how firms make financing decisions, we will discuss topics like security issuance, capital structure, and firm investment decisions (the net present value approach, and mergers and acquisitions). In addition, if time permits, we will cover some topics in behavioral finance and household finance such as limits to arbitrage and investor behavior.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/BEM/"
  },
  {
    "course_code": "BEM 104",
    "course_title": "Investments",
    "course_description": "Examines the theory of financial decision making and statistical techniques useful in analyzing financial data. Topics include portfolio selection, equilibrium security pricing, empirical analysis of equity securities, fixed-income markets, market efficiency, and risk management.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/BEM/"
  },
  {
    "course_code": "BEM 105",
    "course_title": "Options",
    "course_description": "An introduction to option pricing theory and risk management in the discrete-time, bi-nomial tree model, and the continuous time Black-Scholes-Merton framework. Both the partial differential equations approach and the martingale approach (risk-neutral pricing by expected values) will be developed. The course will cover the basics of Stochastic, Ito Calculus. Since 2015, the course is offered in the flipped format: the students are required to watch lectures online, while problem solving and case and paper presentations are done in class.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/BEM/"
  },
  {
    "course_code": "BEM 106",
    "course_title": "Data Science in Economics",
    "course_description": "This course revolves around qualitative topics and quantitative methods in data science for finance and economics. We discuss linear models and inference, sources of bias, databases and data validation, scraping, clustering, and text analysis. A special emphasis is placed on developing a robust understanding of the strengths and weaknesses of social science research methods. The class also introduces students to the Python programming language and its ecosystem of packages.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/BEM/"
  },
  {
    "course_code": "BEM 107",
    "course_title": "Corporate Finance",
    "course_description": "The main objective of the course is to develop insight into the process by which firms can create value for their shareholders. We will study major corporate decisions from the perspective of the firm with an emphasis on the interaction of the firm with financial markets: quantitative project evaluation for investment, choice between borrowing and issuing stock, dividend policy, organizational form (for example, mergers and acquisitions). Theory, empirical evidence, and case analysis all play significant roles in the course. Topics include discounted cash flow models, risk and return, capital asset pricing model, capital market efficiency, capital structure and the cost of capital and dividend policy.\n Not offered 2024-25.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/BEM/"
  },
  {
    "course_code": "BEM 108",
    "course_title": "Mathematical Models in Fintech",
    "course_description": "In this course we will go over recent works on topics broadly contained in the newly emerging field of Fintech. In particular, the topics include mathematical modeling of strategic actions of agents interacting via a blockchain technology, via crowdfunding platforms, and via online investment platforms (\"robo-advisors\").\n Not offered 2024-25.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/BEM/"
  },
  {
    "course_code": "BEM 109",
    "course_title": "Understanding China through Finance",
    "course_description": "In this course we will develop a deep understanding of the institutional foundations of Chinese finance, and we will use this framework to study the strengths and weaknesses of the Chinese economic system through the lens of finance. We will start from a historical overview of Chinese finance and will study the institutions that drive financial market development. Next, we will focus on the unique economic features of the three main channels of Chinese finance: capital markets (including the stock and bond markets), bank- and fund-based intermediation (including the banking sector, shadow-banking, and private equity, and venture capital), and informal finance. Finally, we will study the opportunities and challenges posed by Chinese-style finance for the future development of the global financial system.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/BEM/"
  },
  {
    "course_code": "BEM 110",
    "course_title": "Venture Capital",
    "course_description": "An introduction to the theory and practice of venture capital financing of start-ups. This course covers the underlying economic principles and theoretical models relevant to the venture investment process, as well as the standard practices used by industry and detailed examples. Topics include: The history of VC; VC stages of financing; financial returns to private equity; LBOs and MBOs; people versus ideas; biotech; IPOs; and CEO transitions.\n Not offered 2024-25.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/BEM/"
  },
  {
    "course_code": "BEM 111",
    "course_title": "Quantitative Risk and Portfolio Management",
    "course_description": "Investors demand reward for taking risk. Concepts of Knightian risk and uncertainty; risk preference (risk-neutral Q vs. real-world P probability measures); coherent risk; and commonly used metrics for risk are explored. The integration of risk and reward in classical efficient portfolio construction is described, along with the drawbacks of this approach in practice and methods for addressing these drawbacks. The leptokurtic (fat-tailed) nature of financial data and approaches to modeling financial surprises are covered, leading to inherently leptokurtic techniques for estimating volatility and correlation. Scenario analysis, and regime-switching methods are shown to provide ways of dealing with risk in extreme environments. The special nature of modeling long/short portfolios (hedge funds) is explored. The text for the class is a Jupyter Notebook with Python code segments.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/BEM/"
  },
  {
    "course_code": "BEM 112",
    "course_title": "International Financial Markets",
    "course_description": "The course offers an introduction to international financial markets, their comparative behavior, and their inter-relations. The principal focus will be on assets traded in liquid markets: currencies, equities, bonds, swaps, and other derivatives. Attention will be devoted to (1) institutional arrangements, taxation, and regulation, (2) international arbitrage and parity conditions, (3) valuation, (4) international diversification and portfolio management, (5) derivative instruments, (6) hedging, (7) dynamic investment strategies, (8) other topics of particular current relevance and importance.\n Not offered 2024-25.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/BEM/"
  },
  {
    "course_code": "BEM 113",
    "course_title": "Law and Finance for Start-Ups",
    "course_description": "This course combines elements of business, economics, engineering, financial statement analysis, strategy, and law to provide students interested in entrepreneurship with a practical understanding of the mechanics of growing a 'post-idea' company. The class will explain how prospective investor’s view entrepreneurs and their ideas, teach students about types of capital, sources of capital, and term sheets, and generally delve into the timing and financial alternatives and trade-offs facing entrepreneurs seeking capital in order to launch or grow a company. As such, this class is a complement to BEM 110 (Venture Capital) and E 102 (Scientific and Technology Entrepreneurship).",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/BEM/"
  },
  {
    "course_code": "BEM 114",
    "course_title": "Hedge Funds",
    "course_description": "This course is an in-depth study of the hedge fund industry. We will study hedge fund trading strategies, the business model of hedge funds, hedge fund investors, as well as the institutional and regulatory framework in which hedge funds operate. The course will evaluate and analyze popular hedge fund trading strategies, including equity strategies (activist, market-neutral, long/short, event-driven, etc.), arbitrage strategies (derivatives, convertible, fixed-income, currency and global macro, etc.), and fund of hedge funds. The course will also analyze the hedge fund business model, including: performance evaluation and risk management; fund compensation and contractual features; transaction costs and market impact; as well as fund raising and marketing. In addition, the course will study the institutional relationships hedge funds have with service providers (prime brokers, custodian banks, etc.) and with regulators. We will also discuss public policy implications and the value of hedge funds in society. This course is designed to provide students with the skills necessary to evaluate hedge fund strategies, and to develop, manage, and successfully grow a hedge fund business.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/BEM/"
  },
  {
    "course_code": "BEM 115",
    "course_title": "Business Law",
    "course_description": "This course will serve as an introduction to the American legal system emphasizing concepts which students are likely to encounter in their professional lives such as Constitutional law (federalism; statesâ\u0080\u0099 rights; structure of court systems), dispute resolution (litigation; mediation; arbitration), contracts (elements; defenses to formation; remedies), employment law, business associations (partnerships; corporations; LLCs), securities regulation, and intellectual property (patents; trademarks; trade secrets; copyrights). By learning to identify issues which would alert one to the need for a lawyer, the class will sensitize students to key legal issues they may encounter in the normal course of business. Textbook reading and lectures will be supplemented by practicing lawyers expert in their field of business law as guest speakers.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/BEM/"
  },
  {
    "course_code": "BEM 117",
    "course_title": "Behavioral Finance",
    "course_description": "Much of modern financial economics works with models in which agents are fully rational, in that they maximize expected utility and use Bayes' law to update their beliefs. Behavioral finance is a large and active field that develops and studies models in which some agents are less than fully rational. Such models have two building blocks: limits to arbitrage, which makes it difficult for rational traders to undo the dislocations caused by less rational traders; and psychology, which provides guidance for the kinds of deviations from full rationality we might expect to see. We discuss these two topics and consider a number of applications: asset pricing; individual trading behavior; the origin of bubbles; and financial crises.\n Not offered 2024-25.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/BEM/"
  },
  {
    "course_code": "BEM/Ec/ESE 119",
    "course_title": "Environmental Economics",
    "course_description": "This course provides a survey from the perspective of economics of public policy issues regarding the management of natural resources and the protection of environmental quality. The course covers both conceptual topics and recent and current applications. Included are principles of environmental and resource economics, management of nonrenewable and renewable resources, and environmental policy with the focus on air pollution problems, both local problems (smog) and global problems (climate change).",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/BEM/"
  },
  {
    "course_code": "BEM/Ec 120",
    "course_title": "Introduction to Sports Science",
    "course_description": "The use of large data sets and innovative statistical methods has revolutionized professional and intercollegiate sports. This course introduces students to the academic and professional world of contemporary sports science. The course will meet biweekly with instructor lectures on sports science and with guest speakers from collegiate and professional sports. Students will be introduced to the primary data sources for sports science, to methods used to collect sports performance and outcomes data, and to the statistical tools used for sports analytics (for example, logistic regression, regression trees and random forest, network models, time series, and natural language processing). Students will be responsible for weekly writing or homework assignments based on readings and speaker presentations, as well as a quarter-long sports analytics research project. Students should have some background in econometrics, statistics and probability, data science, or machine learning.",
    "_source_url": "https://catalog.caltech.edu/current/2024-25/department/BEM/"
  }
]